{
    "full_name": "Pradeep Kumar P C",
    "email": "N/A",
    "phone": "N/A",
    "linkedin": "N/A",
    "summary": "Pradeep Kumar P C Senior Technology Lead – Infrastructure & DevOps Highly experienced Senior Technology Lead with over 10 years in Infrastructure and DevOps, specializing in cloud architecture and automation. Proven ability to design, implement, and optimize high-availability (HA) cloud and on- premises infrastructures using AWS, Azure, Docker, and CI/CD pipelines. Expertise includes configuration management (Ansible), database tuning (PostgreSQL, MySQL), and deploying robust infrastructure-as-code solutions for enterprise applications. Cloud Architecture & High Availability (HA): Proven success in designing and implementing HA setups on AWS using Elastic Load Balancers, auto-scaling, and Nginx reverse proxy, ensuring system failover and redundancy. DevOps & Automation: Extensive hands-on experience in automating environment provisioning and deployment workflows using CI/CD pipelines and Ansible playbooks. Database Optimization: Strong background in guiding developers on PostgreSQL and MySQL performance tuning, including indexing, configuration optimization, and replication strategies. Linux System Administration: Over a decade of experience in Linux servers (Red Hat / Ubuntu / CentOS), managing security hardening, monitoring, and patch management for production systems.",
    "skills": [
        "Cloud Platforms",
        "Load Balancers",
        "CodePipeline",
        "CloudWatch",
        "DevOps & CI/CD",
        "CI/CD",
        "Nginx",
        "Ansible",
        "Bash",
        "Python",
        "Databases",
        "Postgresql",
        "Mysql",
        "SQL",
        "Database Tuning",
        "Red Hat",
        "Ubuntu",
        "CentOS",
        "Nginx",
        "Apache",
        "VPN Setup",
        "Cloud Platforms",
        "Load Balancers",
        "CodePipeline",
        "CloudWatch",
        "DevOps & CI/CD",
        "CI/CD",
        "Nginx",
        "Ansible",
        "Bash",
        "Databases",
        "Database Tuning",
        "Red Hat",
        "Ubuntu",
        "CentOS",
        "Nginx",
        "Apache",
        "VPN Setup",
        "Role:",
        "Description:",
        "JAVA",
        "Spring"
    ],
    "tools": [
        "AWS",
        "Azure",
        "Docker",
        "Jenkins",
        "GIT"
    ],
    "work_experience": [],
    "projects": [
        {
            "title": "Duration:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Role:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Description:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Technology Stack:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Responsibilities:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Duration:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Role:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Description:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Technology Stack:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Responsibilities:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Duration:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Role:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Description:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Technology Stack:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Responsibilities:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Duration:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Role:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Description:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Technology Stack:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Responsibilities:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Duration:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Role:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Description:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Technology Stack:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Responsibilities:",
            "tech": "N/A",
            "duration": "N/A",
            "role": "N/A",
            "details": ""
        },
        {
            "title": "Project",
            "tech": "N/A",
            "duration": "",
            "role": "",
            "responsibilities": "",
            "details": ""
        },
        {
            "title": "Oct 2022 - Present (Oct 2025) (37 months)",
            "tech": "N/A",
            "duration": "",
            "role": "",
            "responsibilities": "",
            "details": "Senior Technology Lead  A full-featured Learning Management System built to manage and deliver educational content efficiently. It supports SCORM content, tracks user progress, and includes instructor and student dashboards. Technology Stack: WSO2 Integration Manager, WSO2 API Manager, WSO2 Message Broker, WSO2 Identity Server, PostgreSQL, AWS Developed a WSO2 Carbon-based middleware application to facilitate communication between Trainery network internal applications and clients. Configured and managed AWS cloud infrastructure for UAT and Production environments. Integrated WSO2 components including API Manager, Integration Manager, Message Broker, and Identity Server for seamless service orchestration. Managed PostgreSQL database operations and ensured efficient data flow between middleware and client applications. Project #2: Project Title: Trainery (Linux Administration & Optimization)"
        },
        {
            "title": "Jan 2022 - Sep 2023 (21 months)",
            "tech": "N/A",
            "duration": "",
            "role": "",
            "responsibilities": "",
            "details": "Infrastructure Manager  A full-featured Learning Management System built to manage and deliver educational content efficiently. It supports SCORM content, tracks user progress, and includes instructor and student dashboards. Technology Stack: AWS, MySQL, Nginx/PHP-FPM, Monitoring Scripts Managed AWS infrastructure, implemented MySQL tuning, and Nginx/PHP-FPM optimization. Managed server monitoring, firewall configurations, VPNs, and security hardening for production systems. Pradeep Kumar P C Senior Technology Lead – Infrastructure & DevOps Project #3: Project Title: REVIEWCLOUD"
        },
        {
            "title": "Jul 2020 - Dec 2021 (18 months)",
            "tech": "N/A",
            "duration": "",
            "role": "",
            "responsibilities": "",
            "details": "Senior Technology Lead  A performance management system that provides flexible tools, structures, and processes to turn performance reviews into extraordinary performance. Technology Stack: Java, Spring Boot, MySQL, Apache Tomcat 7 Designed and managed AWS cloud infrastructure for UAT and Production environments. Implemented CI/CD pipelines to automate build, test, and deployment processes. Developed and deployed Java Spring Boot applications on Apache Tomcat 7. Optimized MySQL database performance and ensured secure data connectivity. Project #4: Project Title: PICTMA (Ansible & Automation Focus)"
        },
        {
            "title": "Jan 2019 - Jun 2020 (18 months)",
            "tech": "N/A",
            "duration": "",
            "role": "",
            "responsibilities": "",
            "details": "Senior Technology Lead  Pictma™ is the first of its kind, a social media platform dedicated to bringing visibility into nation's civil leaders' actions. One can upload photos and videos highlighting civil servants' behaviors like Police officers, Fire Fighters, First Responders, ICE, and Political Leaders in their particular area. Technology Stack: Node.js, AngularJS, PostgreSQL, Nginx, CI/CD Pipelines, Ansible, AWS Automated environment provisioning and deployment workflows using CI/CD pipelines and Ansible playbooks for select projects. Designed and deployed CI/CD pipelines, and optimized AWS cost and performance Pradeep Kumar P C Senior Technology Lead – Infrastructure & DevOps Project #5: Project Title: CloudPlex"
        },
        {
            "title": "Feb 2018 - Dec 2019 (23 months)",
            "tech": "N/A",
            "duration": "",
            "role": "",
            "responsibilities": "",
            "details": "Lead Infrastructure and DevOps  Implemented autoscaled AWS cloud architecture with Docker and Nginx reverse proxy, configured HA and failover mechanisms Technology Stack: AWS (HA/DR), Docker, Nginx, Load Balancers Designed and implemented database architecture, procedures, and triggers; set up the development environment and cloud infrastructure. Deployed the application on AWS using multiple EC2 instances with Tomcat6, Nginx reverse proxy, and Elastic Load Balancers for high availability, load balancing, and failover. Utilized AWS HA/DR strategies, Docker containers, and Nginx optimizations to ensure scalable and resilient deployments. Project #6: Project Title: JUMPLEAD"
        },
        {
            "title": "Sep 2015 - Dec 2017 (28 months)",
            "tech": "N/A",
            "duration": "",
            "role": "",
            "responsibilities": "",
            "details": "Systems / Database Administrator  Tailored programs and services to enable organizations to achieve their changemaking agenda, including community consultation and stakeholder engagement Technology Stack: Linux, Docker, PostgreSQL,  Bash Monitored and managed servers to ensure high availability and optimal performance. Maintained and administered microservices projects distributed across 100+ Docker instances. Performed regular system and database health checks, backups, and performance tuning. Troubleshot and resolved server, container, and database issues to minimize downtime. Pradeep Kumar P C Senior Technology Lead – Infrastructure & DevOps Project #7: Project Title: Tangram"
        },
        {
            "title": "Jun 2013 - Aug 2015 (27 months)",
            "tech": "N/A",
            "duration": "",
            "role": "",
            "responsibilities": "",
            "details": "Systems / Database Administrator  A multi-tier enterprise web application deployment focused on optimizing PostgreSQL and Tomcat performance, and ensuring high availability and scalability using AWS Elastic Load Balancing. Technology Stack: Ext JS, Java, PostgreSQL, Apache Tomcat 6 Designed database schema, procedures, and triggers; set up the development environment and implemented cloud infrastructure. Deployed the project on AutoGrow Group EC2 instances with Elastic Load Balancing for high availability and scalability. Tuned PostgreSQL configurations to achieve maximum database performance. Configured Tomcat 6 with optimized Java heap settings to enhance application performance. Project #8: Project Title: Field Plex"
        },
        {
            "title": "Apr 2011 - May 2013 (26 months)",
            "tech": "N/A",
            "duration": "N/A",
            "role": "",
            "responsibilities": "",
            "details": "Systems / Database Administrator  Cloud Server Optimization Technology Stack: NodeJS, PHP, Angular, PostgreSQL, Nginx Optimized PostgreSQL performance through indexing and configuration tuning. Improved server efficiency by configuring Nginx and cloud environments. Enhanced backend performance and scalability using Node.js and PHP. Supported seamless API integration with Angular for improved data flow."
        }
    ],
    "education": [
        {
            "degree": "Diploma in Computer Science and Engineering, Institution of Electronics and Telecommunication Engineers",
            "institution": "(IETE), New Delhi",
            "duration": "N/A"
        }
    ],
    "certifications": []
}