{"projects": [{"title": "and consistent design across applications.", "tech": "Lit", "duration": "N/A", "role": "Developed modular, reusable web components for enterprise applications including email/SMS notification systems, message modals, quiz management interfaces, and DocuStore (document management system)."}, {"title": "LMS Application| Full stack Developer", "tech": "Angular 19, NodeJS, LitElement", "duration": "N/A", "role": "Integrated email web component into the Angular-Node based Learning Management System, handling both front-end integration and backend connectivity. Developed Node.js APIs"}, {"title": "LMS Reports |Backend Developer", "tech": "Laravel 5.3, MySQL", "duration": "N/A", "role": "Resolved bugs within reporting modules to ensure accurate display of course statuses and user statistics. Improved stability and data consistency across report views used by administrators"}, {"title": "systems for entertainment and architectural applications.", "tech": "React 18", "duration": "N/A", "role": "▪ Built features for project data extraction and enabled export/download of project configurations in XML and JSON formats, streamlining project documentation workflow. Integrated REST APIs to fetch, display, and manage real-time project data, ensuring"}, {"title": "into an existing PHP project, leveraging the latest JavaScript technologies.", "tech": "Core PHP 5.4, MySQL, JavaScript", "duration": "N/A", "role": "Integrated responsive pages with legacy PHP and modern JavaScript. Refactored core functions to support responsive design and improve UX. Collaborated with frontend team for data consistency and performance."}, {"title": "Crunchet Mobile App| Backend Developer", "tech": "Laravel 5.3, MySQL", "duration": "N/A", "role": "▪ Ensured smooth integration of the new feature with the app’s backend, enabling users to select from multiple categories during the signup process. Added a new API to the existing app to support the signup process or organizational"}, {"title": "Crunchet Web Application | Full stack Developer", "tech": "React, Node.js, Express", "duration": "N/A", "role": "▪ Collaborated on responsive UI design and component-based architecture. ▪ Developed and integrated frontend components with dynamic API endpoints. ▪ Managed environment configuration, CORS policies, and frontend-backend"}, {"title": "standings.", "tech": "Laravel 8, MySQL.", "duration": "N/A", "role": "Developed a new application from scratch using Laravel 8, incorporating features such as team registration, scoring, and scheduling to streamline tournament management."}, {"title": "keep score, and submit match reports.", "tech": "Yii1, AJAX, JS, XML, CSS, MySQL", "duration": "N/A", "role": "Added new features to existing web pages as per client requirements, enhancing the platform’s functionality. Developed and maintained the backend logic to support team registration, match"}, {"title": "providing better opportunities, that include both candidate and recruiter management.", "tech": "Laravel, JS, AJAX, Elasticsearch, MySQL, etc.", "duration": "N/A", "role": "Enhanced existing dynamic web pages by adding new features and optimizing performance to meet project deadlines. Integrated open-source and third-party applications, maintaining quality assurance and"}, {"title": "admin, offering a range of features to enhance user and admin interaction.", "tech": "Core PHP, MySQL, etc.", "duration": "N/A", "role": "Assisted in all phases of the development lifecycle, including requirement gathering, report preparation, and database maintenance. Designed and developed dynamic websites based on client requirements, ensuring"}, {"title": "parents, and teachers in managing academic activities and performance.", "tech": "Laravel, AJAX, JS, MySQL, etc.", "duration": "N/A", "role": "Contributed to the analysis, design, and development of new features for the platform. Designed, developed, and tested software enhancements for various application sizes (small, medium, large)."}], "skills": ["Highly adaptable and quick to learn new technologies and tools", "capable of thriving in", "diverse work environments.", "Passionate about continuous learning and exploring emerging technologies.", "Laravel 11", "10", "8.0", "5.2", "4.2", "JavaScript", "HTML5", "Core PHP", "CSS", "jQuery", "JSON"], "overall_confidence": 0.95}