{"skills": [], "work_experience": [{"company": "Principal Engineer", "role": "InnovateTech Corp", "duration": "Aug 2020 – Present", "responsibilities": "Bangalore, India  Led technical vision for 50+ engineers across multiple product teams. Designed enterprise- grade microservices architecture processing 1B+ transactions/month. Reduced  infrastructure costs by 45% through optimization and cloud migration. Mentored 15+  engineers, 3 promoted to senior roles. Established engineering best practices and code  review standards. "}, {"company": "Senior Architect", "role": "CloudScale Systems", "duration": "Jan 2018 – Jul 2020", "responsibilities": "Bangalore, India  Architected real-time analytics platform serving 10M+ daily active users. Led migration of  monolithic system to 30+ microservices. Implemented message queue (Kafka) reducing  system latency by 60%. Built machine learning pipeline for fraud detection achieving 96% "}, {"company": "Tech Lead", "role": "DataSoft Solutions", "duration": "Jun 2015 – Dec 2017", "responsibilities": "Led team of 8 engineers building data processing platform. Designed PostgreSQL schema  optimizing complex queries. Implemented caching strategy (Redis) improving response  time by 70%. Mentored junior developers and conducted technical interviews. "}, {"company": "Senior Software Engineer", "role": "WebBuilder Inc", "duration": "Mar 2013 – May 2015", "responsibilities": "Developed backend services for e-commerce platform handling 100K concurrent users.  Implemented payment gateway integrations with Stripe and PayPal. Built RESTful APIs with  comprehensive documentation. "}, {"company": "Software Engineer", "role": "StartupLab", "duration": "Sep 2011 – Feb 2013", "responsibilities": "Early-stage startup where I wore multiple hats - built features, infrastructure, and  processes. Developed core platform in Python and JavaScript. Managed AWS  infrastructure and scaling.  TECHNICAL EXPERTISE  Languages: Python, Java, JavaScript, Go, SQL, Bash  Cloud Platforms: AWS (20+ services), GCP, Azure  Databases: PostgreSQL, MySQL, MongoDB, Cassandra, DynamoDB, Redis "}, {"company": "Indian Institute of Technology, Bombay", "role": "Bachelor of Technology in Computer Science", "duration": "2011", "responsibilities": ""}, {"company": "CGPA: 8.8/10", "role": "Thesis: \"Distributed Systems Optimization\"", "duration": "N/A", "responsibilities": "Bachelor of Technology in Computer Science "}, {"company": "Delhi Institute of Technology", "role": "CERTIFICATIONS & AWARDS", "duration": "2009", "responsibilities": ""}, {"company": "CGPA: 8.5/10", "role": "National Merit Scholar", "duration": "N/A", "responsibilities": "CERTIFICATIONS & AWARDS  AWS Solutions Architect – Professional (2023)  Google Cloud Professional Cloud Architect (2022)  \"Tech Leader of the Year\" Award – InnovateTech Corp (2022)  Kubernetes Application Developer (CKAD) (2021)  SPEAKING & COMMUNITY  Speaker: \"Scaling Microservices to Billions of Requests\" – PyCon India 2023 "}], "projects": []}