{"skills": ["Certified Scrum Master", "Project planning & scheduling", "Problem solving", "Microsoft"], "work_experience": [{"company": "AlignMinds Technologies", "role": "Kochi", "duration": "March 2021 to Present", "responsibilities": "Led project management efforts for multiple projects, ensuring effective coordination among cross-functional teams to meet project goals within Conducted RACI and RAID analyses to ensure role clarity, minimize risks, and identify project dependencies, resulting in streamlined workflows and enhanced team accountability. Actively engaged in client communications to manage expectations, provide updates, and gather feedback, ensuring client satisfaction and alignment"}, {"company": "Metarouge Innovations", "role": "Kochi", "duration": "September 2014 to September 2018", "responsibilities": "Addressed problems with service delivery to maintain and enhance client satisfaction. Updated the stakeholders and team members with the development, issues Provided support in creating and implementing project plans. Communicated with various teams, managements, and stakeholders Acted as point of contact for external communications."}, {"company": "RevenueMed India PVT Ltd", "role": "Trivandrum", "duration": "November 2010 to April 2012", "responsibilities": "Worked as an IP coder for US clients. Prepared business documents for upper management and executives. Maintained effective relationships with coworkers and clients. Identified risks and opportunity areas and highlighted them to the team."}], "projects": [{"title": "Project Name:  RepliGen", "tech": "N/A", "duration": "N/A", "role": "Ireland: designed for Treaty Digital to streamline purchase order processing through intelligent email and document handling. The solution leverages Microsoft Azure services to automate end-to-end workflows, reducing manual effort and"}, {"title": "Project Name:  Limerick", "tech": "N/A", "duration": "N/A", "role": "Ireland: Treaty Digital aimed at improving performance tracking for coaching staff. The engagement focused on optimizing dashboards, refining visual insights, and improving user experience for data-driven decision-making."}, {"title": "Project Name:  SmileAI-Operations", "tech": "N/A", "duration": "N/A", "role": "US: initiative supporting the SmileAI platform, which streamlines dental billing workflows for U.S.-based clients. The engagement covers end-to-end project ownership, including client onboarding, automation governance, team"}, {"title": "Project Name:  ACEI Global Website Development", "tech": "N/A", "duration": "N/A", "role": "US: organization dedicated to providing educational services, focusing on academic credential evaluation, international education resources, and professional development for educators and institutions worldwide. It aims to facilitate global"}, {"title": "BTech in Biotechnology", "tech": "N/A", "duration": "N/A", "role": "METS school of Engineering (Calicut university): Certified ScrumMaster (CSM)"}, {"title": "Project Name:  Briive", "tech": "N/A", "duration": "N/A", "role": "Thailand: and convenience by providing real-time tracking of users' locations. It offers features such as route history, geofencing alerts, and location sharing to keep users connected and informed about their whereabouts."}]}