{"skills": ["Highly adaptable and quick to learn new technologies and tools", "capable of thriving in", "diverse work environments.", "Laravel 11", "10", "8.0", "5.2", "4.2", "JavaScript", "HTML5", "Node.js", "Angular.js", "React", "Microsoft Visual Studio", "Code", "Kibana Postman Git Asana"], "work_experience": [{"company": "AlignMinds Technologies, Kochi, India", "role": "Software Engineer", "duration": "Feb 2021 - Present", "responsibilities": "Developed reusable web components using LitElement including email/SMS notification systems, message modals, quiz management interfaces, and document storage (DocuStore) that can be reused across applications. Integrated web components into Angular/React applications and built supporting Node.js APIs for seamless functionality. Optimized existing products through performance tuning and code refactoring, improving system efficiency."}, {"company": "Aventus Informatics, Koratty, India", "role": "Jr. Software Engineer", "duration": "Nov 2018 - Feb 2021", "responsibilities": "Worked on both the Frontend and Backend sides of various applications. Built various features for the client's products. Supported the team with technical debugging and unit testing. Worked on user guides."}, {"company": "Tecnonauts Technology Services Pvt Ltd, Kochi, India", "role": "Web Developer", "duration": "Feb 2018 - Oct 2018", "responsibilities": "Designed, developed, and tested small, medium, and large-scale software Create website layout/user interface by using standard HTML/CSS practices."}, {"company": "ChipsNBytes IT Management Services Pvt Ltd, Kochi, India", "role": "Web Application Developer", "duration": "Oct 2015 - Dec 2017", "responsibilities": "Participated in analysis, design, and new development of applications. Designed, developed, and tested small, medium, and large-scale software Tested changes to the user interface, application functionality, and database access as required by the client organizations."}], "projects": [{"title": "WebComponent", "tech": "Lit", "duration": "N/A", "role": "Front Development: components with cross-framework compatibility, focusing on performance, maintainability, and consistent design across applications. Developed modular, reusable web components for enterprise applications including"}, {"title": "LMS Application", "tech": "Angular 19, NodeJS, LitElement", "duration": "N/A", "role": "Full stack Developer: Integrated email web component into the Angular-Node based Learning Management System, handling both front-end integration and backend connectivity. Developed and implemented AWS SQS queue with Lambda functions for reliable email notification"}, {"title": "LMS Reports", "tech": "Laravel 5.3, MySQL", "duration": "N/A", "role": "Backend Developer: Resolved bugs within reporting modules to ensure accurate display of course statuses and user statistics. Improved stability and data consistency across report views used by administrators"}, {"title": "ETC", "tech": "React 18", "duration": "N/A", "role": "Frontend Developer: Built features for project data extraction and enabled export/download of project configurations in XML and JSON formats, streamlining project documentation workflow. Integrated REST APIs to fetch, display, and manage real-time project data, ensuring"}, {"title": "Thoroughbred", "tech": "Core PHP 5.4, MySQL, JavaScript", "duration": "N/A", "role": "Backend Developer: into an existing PHP project, leveraging the latest JavaScript technologies. Integrated responsive pages with legacy PHP and modern JavaScript. Refactored core functions to support responsive design and improve UX."}, {"title": "Crunchet Mobile App", "tech": "Laravel 5.3, MySQL", "duration": "N/A", "role": "Backend Developer: Ensured smooth integration of the new feature with the app’s backend, enabling users to select from multiple categories during the signup process. Added a new API to the existing app to support the signup process or organizational"}, {"title": "Crunchet Web Application", "tech": "React, Node.js, Express", "duration": "N/A", "role": "Full stack Developer: Collaborated on responsive UI design and component-based architecture. Developed and integrated frontend components with dynamic API endpoints. Managed environment configuration, CORS policies, and frontend-backend"}, {"title": "Tournament", "tech": "Laravel 8, MySQL.", "duration": "N/A", "role": "Full stack Developer: Developed a new application from scratch using Laravel 8, incorporating features such as team registration, scoring, and scheduling to streamline tournament management. Tools: VS Code, Git, Postman."}, {"title": "Coast Soccer League", "tech": "Yii1, AJAX, JS, XML, CSS, MySQL", "duration": "N/A", "role": "Backend Developer: registrations, scheduling, standings, and reporting, while supporting both the CSL and Users can utilize the CSL App to manage team details, report game results, and rate referees and other teams. Similarly, the Referee App helps referees manage schedules,"}, {"title": "Xcruit", "tech": "Laravel, JS, AJAX, Elasticsearch, MySQL, etc.", "duration": "N/A", "role": "Web Application Developer: Enhanced existing dynamic web pages by adding new features and optimizing performance to meet project deadlines. Integrated open-source and third-party applications, maintaining quality assurance and"}, {"title": "Dreamplore", "tech": "Core PHP, MySQL, etc.", "duration": "N/A", "role": "Web Application Developer: Assisted in all phases of the development lifecycle, including requirement gathering, report preparation, and database maintenance. Designed and developed dynamic websites based on client requirements, ensuring"}, {"title": "Web your Campus", "tech": "Laravel, AJAX, JS, MySQL, etc.", "duration": "N/A", "role": "Web Application Developer: Contributed to the analysis, design, and development of new features for the platform. Designed, developed, and tested software enhancements for various application sizes (small, medium, large)."}]}